; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v13 ?v8)
             (pred_6 ?v6 ?v9)
             (pred_2 ?v13 ?v9)
             (pred_4 ?v10 ?v13 )
	     (pred_8 ?v13)
             (pred_5 ?v4)
             (pred_9 ?v6)
             (pred_12 ?v9)
             (pred_7 ?v13)
             (pred_3 ?v6)
             (pred_11 ?v13)
             (pred_1 ))



(:action op_1
:parameters (?v12 ?v5 ?v3 ?v11)
:precondition (and (pred_5 ?v12) (pred_5 ?v5) (pred_9 ?v3) (pred_12 ?v11)
          (pred_10 ?v12 ?v5) (pred_6 ?v3 ?v11)
                   (pred_2 ?v5 ?v11) (pred_8 ?v12) 
                   (pred_7 ?v5) (pred_3 ?v3))
:effect (and  (pred_11 ?v5) (not (pred_7 ?v5))))


(:action op_5
:parameters (?v12 ?v7)
:precondition (and (pred_5 ?v12) (pred_5 ?v7)
               (pred_8 ?v12) (pred_10 ?v12 ?v7) (pred_11 ?v7))
:effect (and (pred_8 ?v7) (not (pred_8 ?v12))))

(:action op_3
:parameters (?v12 ?v3)
:precondition (and (pred_5 ?v12) (pred_9 ?v3) 
                  (pred_8 ?v12) (pred_4 ?v3 ?v12) (pred_1 ))
:effect (and (pred_3 ?v3)
   (not (pred_4 ?v3 ?v12)) (not (pred_1 ))))


(:action op_2
:parameters (?v12 ?v2 ?v1)
:precondition (and (pred_5 ?v12) (pred_9 ?v2) (pred_9 ?v1)
                  (pred_8 ?v12) (pred_3 ?v1) (pred_4 ?v2 ?v12))
:effect (and (pred_3 ?v2) (pred_4 ?v1 ?v12)
        (not (pred_3 ?v1)) (not (pred_4 ?v2 ?v12))))

(:action op_4
:parameters (?v12 ?v3)
:precondition (and (pred_5 ?v12) (pred_9 ?v3) 
                  (pred_8 ?v12) (pred_3 ?v3))
:effect (and (pred_1 ) (pred_4 ?v3 ?v12) (not (pred_3 ?v3)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_06 obj_18 obj_21 obj_17 obj_01 obj_13 obj_09 obj_14 obj_12 obj_05 obj_07 obj_20 obj_19 obj_10 obj_02 obj_08
    obj_16 obj_03
    obj_11 obj_04 obj_15
    )

    (:init
       (pred_1)

       (pred_5 obj_06)
       (pred_5 obj_18)
       (pred_5 obj_21)
       (pred_5 obj_17)
       (pred_5 obj_01)
       (pred_5 obj_13)
       (pred_5 obj_09)
       (pred_5 obj_14)
       (pred_5 obj_12)
       (pred_5 obj_05)
       (pred_5 obj_07)
       (pred_5 obj_20)
       (pred_5 obj_19)
       (pred_5 obj_10)
       (pred_5 obj_02)
       (pred_5 obj_08)
       (pred_12 obj_16)
       (pred_12 obj_03)
       (pred_9 obj_11)
       (pred_9 obj_04)
       (pred_9 obj_15)

       (pred_10 obj_06 obj_01)
       (pred_10 obj_06 obj_18)
       (pred_10 obj_18 obj_13)
       (pred_10 obj_18 obj_21)
       (pred_10 obj_18 obj_06)
       (pred_10 obj_21 obj_09)
       (pred_10 obj_21 obj_17)
       (pred_10 obj_21 obj_18)
       (pred_10 obj_17 obj_14)
       (pred_10 obj_17 obj_21)
       (pred_10 obj_01 obj_12)
       (pred_10 obj_01 obj_13)
       (pred_10 obj_01 obj_06)
       (pred_10 obj_13 obj_05)
       (pred_10 obj_13 obj_09)
       (pred_10 obj_13 obj_18)
       (pred_10 obj_13 obj_01)
       (pred_10 obj_09 obj_07)
       (pred_10 obj_09 obj_14)
       (pred_10 obj_09 obj_21)
       (pred_10 obj_09 obj_13)
       (pred_10 obj_14 obj_20)
       (pred_10 obj_14 obj_17)
       (pred_10 obj_14 obj_09)
       (pred_10 obj_12 obj_19)
       (pred_10 obj_12 obj_05)
       (pred_10 obj_12 obj_01)
       (pred_10 obj_05 obj_10)
       (pred_10 obj_05 obj_07)
       (pred_10 obj_05 obj_13)
       (pred_10 obj_05 obj_12)
       (pred_10 obj_07 obj_02)
       (pred_10 obj_07 obj_20)
       (pred_10 obj_07 obj_09)
       (pred_10 obj_07 obj_05)
       (pred_10 obj_20 obj_08)
       (pred_10 obj_20 obj_14)
       (pred_10 obj_20 obj_07)
       (pred_10 obj_19 obj_10)
       (pred_10 obj_19 obj_12)
       (pred_10 obj_10 obj_02)
       (pred_10 obj_10 obj_05)
       (pred_10 obj_10 obj_19)
       (pred_10 obj_02 obj_08)
       (pred_10 obj_02 obj_07)
       (pred_10 obj_02 obj_10)
       (pred_10 obj_08 obj_20)
       (pred_10 obj_08 obj_02)
       (pred_7 obj_13)
       (pred_7 obj_01)
       (pred_7 obj_18)
       (pred_2  obj_13 obj_16)
       (pred_2  obj_01 obj_03)
       (pred_2  obj_18 obj_03)
       (pred_11 obj_06)
       (pred_11 obj_21)
       (pred_11 obj_17)
       (pred_11 obj_09)
       (pred_11 obj_14)
       (pred_11 obj_12)
       (pred_11 obj_05)
       (pred_11 obj_07)
       (pred_11 obj_20)
       (pred_11 obj_19)
       (pred_11 obj_10)
       (pred_11 obj_02)
       (pred_11 obj_08)

       (pred_6  obj_11 obj_16)
       (pred_6  obj_04 obj_03)
       (pred_6  obj_15 obj_16)
       (pred_4 obj_11 obj_19)
       (pred_4 obj_04 obj_08)
       (pred_4 obj_15 obj_08)
       (pred_8 obj_21)
    )

    (:goal (and
       (pred_4 obj_11 obj_20)
    ))
(:constraints
  (always (not (pred_8 obj_07)))
)
)

; plan
1. (op_5 obj_21 obj_09)
   deleted: (pred_8 obj_21)
   added: (pred_8 obj_09)
   goals met: 0 of 1
2. (op_5 obj_09 obj_14)
   deleted: (pred_8 obj_09)
   added: (pred_8 obj_14)
   goals met: 0 of 1
3. (op_5 obj_14 obj_20)
   deleted: (pred_8 obj_14)
   added: (pred_8 obj_20)
   goals met: 0 of 1
4. (op_5 obj_20 obj_08)
   deleted: (pred_8 obj_20)
   added: (pred_8 obj_08)
   goals met: 0 of 1
5. (op_5 obj_08 obj_02)
   deleted: (pred_8 obj_08)
   added: (pred_8 obj_02)
   goals met: 0 of 1
6. (op_5 obj_02 obj_10)
   deleted: (pred_8 obj_02)
   added: (pred_8 obj_10)
   goals met: 0 of 1
7. (op_5 obj_10 obj_19)
   deleted: (pred_8 obj_10)
   added: (pred_8 obj_19)
   goals met: 0 of 1
8. (op_3 obj_19 obj_11)
   deleted: (pred_4 obj_11 obj_19) (pred_1)
   added: (pred_3 obj_11)
   goals met: 0 of 1
9. (op_5 obj_19 obj_10)
   deleted: (pred_8 obj_19)
   added: (pred_8 obj_10)
   goals met: 0 of 1
10. (op_5 obj_10 obj_02)
   deleted: (pred_8 obj_10)
   added: (pred_8 obj_02)
   goals met: 0 of 1
11. (op_5 obj_02 obj_08)
   deleted: (pred_8 obj_02)
   added: (pred_8 obj_08)
   goals met: 0 of 1
12. (op_5 obj_08 obj_20)
   deleted: (pred_8 obj_08)
   added: (pred_8 obj_20)
   goals met: 0 of 1
13. (op_4 obj_20 obj_11)
   deleted: (pred_3 obj_11)
   added: (pred_1) (pred_4 obj_11 obj_20)
   goals met: 1 of 1
